Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV64GM002.h
#define _APPS_APOOV_POSITION                     0x00000003
#define _APPS_APOOV_MASK                         0x00000008
#define _APPS_APOOV_LENGTH                       0x00000001

#define _APPS_STRFUL_POSITION                    0x00000004
#define _APPS_STRFUL_MASK                        0x00000010
#define _APPS_STRFUL_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FSEC (0xab80)                               */

extern __attribute__((space(prog))) unsigned int _FSEC;
#define _FSEC(x) __attribute__((section("__FSEC.sec"),space(prog))) unsigned int _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect Bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HIGH             High Security
**     BSS_HIGH_BOOT        High Security
**     BSS_STNDRD           Standard Security
**     BSS_STNDRD_BOOT      Standard Security
**     BSS_DISABLED         No Protection (other than BWRP)
**     BSS_NO_BOOT          No Protection (other than BWRP)
**
**   Boot Segment Control Bit:
**     BSS2_ON              Boot Segment size determined by FBSLIM
**     BSS2_OFF             No Boot Segment
**
**   General Segment Write-Protect Bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HIGH             High Security
**     GSS_HIGH_GENERAL     High Security
**     GSS_STNDRD           Standard Security
**     GSS_STNDRD_GENERAL   Standard Security
**     GSS_DISABLED         No Protection (other than GWRP)
**     GSS_NO_GENERAL       No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect Bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HIGH             High Security
**     CSS_HIGH_CONFIG      High Security
**     CSS_ENHNCD           Enhanced Security
**     CSS_ENHNCD_CONFIG    Enhanced Security
**     CSS_STNDRD           Standard Security
**     CSS_STNDRD_CONFIG    Standard Security
**     CSS_DISABLED         No Protection (other than CWRP)
**     CSS_NO_CONFIG        No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table Disable Bit :
**     AIVTDIS_ENABLE       Enable Alternate Vector Table
**     AIVTDIS_DISABLE      Disable Alternate Vector Table
**
*/

#define BWRP_ON              0xFFFE
#define BWRP_OFF             0xFFFF

#define BSS_HIGH             0xFFF9
#define BSS_HIGH_BOOT        0xFFF9
#define BSS_STNDRD           0xFFFD
#define BSS_STNDRD_BOOT      0xFFFD
#define BSS_DISABLED         0xFFFF
#define BSS_NO_BOOT          0xFFFF

#define BSS2_ON              0xFFF7
#define BSS2_OFF             0xFFFF

#define GWRP_ON              0xFFDF
#define GWRP_OFF             0xFFFF

#define GSS_HIGH             0xFF3F
#define GSS_HIGH_GENERAL     0xFF3F
#define GSS_STNDRD           0xFFBF
#define GSS_STNDRD_GENERAL   0xFFBF
#define GSS_DISABLED         0xFFFF
#define GSS_NO_GENERAL       0xFFFF

#define CWRP_ON              0xFEFF
#define CWRP_OFF             0xFFFF

#define CSS_HIGH             0xF1FF
#define CSS_HIGH_CONFIG      0xF1FF
#define CSS_ENHNCD           0xF9FF
#define CSS_ENHNCD_CONFIG    0xF9FF
#define CSS_STNDRD           0xFDFF
#define CSS_STNDRD_CONFIG    0xFDFF
#define CSS_DISABLED         0xFFFF
#define CSS_NO_CONFIG        0xFFFF

#define AIVTDIS_ENABLE       0x7FFF
#define AIVTDIS_DISABLE      0xFFFF

/* Register FBSLIM (0xab90)                               */

extern __attribute__((space(prog))) unsigned int _FBSLIM;
#define _FBSLIM(x) __attribute__((section("__FBSLIM.sec"),space(prog))) unsigned int _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Code Flash Page Address Limit Bits:
**
*/


/* Register FOSCSEL (0xab98)                               */

extern __attribute__((space(prog))) unsigned int _FOSCSEL;
#define _FOSCSEL(x) __attribute__((section("__FOSCSEL.sec"),space(prog))) unsigned int _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Initial oscillator Source Selection Bits:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV16       Internal Fast RC (FRC) Oscillator with divide by 16
**     FNOSC_FRCDIVN        Internal Fast RC (FRC) Oscillator with postscaler
**
**   Two Speed Oscillator Start-Up Bit:
**     IESO_OFF             Start up device with user selected oscillator source
**     IESO_ON              Start up device with FRC,then automatically switch to user selected oscillator source
**
*/

#define FNOSC_FRC            0xFFF8
#define FNOSC_FRCPLL         0xFFF9
#define FNOSC_PRI            0xFFFA
#define FNOSC_PRIPLL         0xFFFB
#define FNOSC_LPRC           0xFFFD
#define FNOSC_FRCDIV16       0xFFFE
#define FNOSC_FRCDIVN        0xFFFF

